//
//  ViewController.swift
//  GCDSamples_tutorial
//
//  Created by Алина Власенко on 22.02.2023.
//

import UIKit

class ViewController: UIViewController {

    @IBOutlet weak var imageView: UIImageView!
    
    override func viewDidLoad() {
        super.viewDidLoad()
        // Do any additional setup after loading the view, typically from a nib.
    }

    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
        // Dispose of any resources that can be recreated.
    }


    override func viewDidAppear(_ animated: Bool) {
        super.viewDidAppear(animated)
        
        //simpleQueues()
        
        //queuesWithQoS()
        
        
//         concurrentQueues()
        //Метод activate()класу DispatchQueue запустить завдання
//         if let queue = inactiveQueue {
//            queue.activate()
//         }
         
        
//        queueWithDelay()
        
        fetchImage()
        
        useWorkItem()
    }
    
    
    
    func simpleQueues() {
        let queue = DispatchQueue(label: "com.appcoda.myqueue")
        queue.async {
            for i in 0..<10 {
                print("🔴", i)
            }
        }
        for i in 100..<110 {
            print("🔵", i)
        }
        //Наведений вище for цикл буде виконано в основній черзі, тоді як перший буде запущено у фоновому режимі. Він не перейде до циклу основного потоку та не відобразить числа від 100 до 109, доки не завершиться завдання черги. І це відбувається тому, що ми робимо синхронне виконання
        
        //Але що станеться, якщо ми використаємо async метод і дозволимо блоку коду черги виконуватися асинхронно? У цьому випадку виконання програми не зупинятиметься в очікуванні завершення завдання черги; він негайно повернеться до основного потоку, а другий forцикл буде виконано одночасно з циклом черги.
    }
    
    //Якість обслуговування (QoS) і пріоритети
    func queuesWithQoS() {
        //ставимо для черг однаковий пріорітет виконання.
        let queue1 = DispatchQueue(label: "com.appcoda.queuel", qos: DispatchQoS.userInitiated)
        //let queue2 = DispatchQueue(label: "com.appcoda.queue2", qos: DispatchQoS.userInitiated)
        //При однаковому приорітеті обох черг - В мене не був такий самий результат як в туторіалі. Лише одночасно виконалися 0 і 100 - потім усі червоні і усі сині. Але кожного разу результат різний. Але ні разу не було так як в туторіалі, що вони виконуються одночасно і через 1.
        //let queue1 = DispatchQueue(label: "com.appcoda.queue1", qos: DispatchQoS.background)
        //зробили 1 чергу .background - тепер у мене - синя перша уся виконуєтьься - потім червона. В туторіалі в перемішку, але синя швидше виконується.
        let queue2 = DispatchQueue(label: "com.appcoda.queue2", qos: DispatchQoS.utility)
        //якщо для 2 черги зробити пріоритет .utility в мене просто виконується червона черга потім синя. В туторіалі 0, 100 - потим усі червоні, потім сині
                
        queue1.async {
            for i in 0..<10 {
                print("🔴", i)
            }
        }
        queue2.async {
            for i in 100..<110 {
                print("🔵", i)
            }
        }
        
        //Добре, все вищесказане пояснює, як працюють класи QoS, але що станеться, якщо ми також виконаємо завдання в основній черзі? Крім того, давайте ще раз змінимо клас QoS першої черги, встановивши вищий пріоритет
        //В мене виконалась уся чорна, потім червона, потім синя - але в туторіалі чорна з красною змішалися, але раніше виконалася чорна, потім довиконалась червона і тільки потім виконалась уся синя. Але це все говорить про те, що основна черга має найвижчий пріоритет.
        for i in 1000..<1010 {
            print("⚫️", i)
        }
        
    }
    
    //Одночасні черги(concurrentQueues)
    var inactiveQueue: DispatchQueue!
    func concurrentQueues() {
        //let anotherQueue = DispatchQueue(label: "com.appcoda.anotherQueue", qos: .utility) //з такою чергою завдання в ній виконаються почергово, бо вона serial. Спільним для всіх попередніх прикладів є те, що наші черги є послідовними (serial), як і ця
        
        //Створемо чергу з додатковим параметром attributes - і вкажемо .concurrent - тобто завдання виконуватимуться одночасно. Але в мене все одно вони виконуються групами - кожного разу в різній постлідовності - у туторіалі чітво усі перемішані - червоний, синій, чорний по одному, потім наступні 3.. і так усі до кінця.
        //let anotherQueue = DispatchQueue(label: "com.appcoda.anotherQueue", qos: .utility, attributes: .concurrent)
        
        //Параметр attributes також може приймати інше значення під назвою initiallyInactive. Використовуючи це, виконання завдань не починається автоматично, натомість розробник має ініціювати виконання.
        //Використання властивості класу в цьому випадку є необхідним, оскільки визначено anotherQueueв concurrentQueues()методі і його видно лише там. Програма не дізнається про це, коли вийде з методу, ми не зможемо активувати чергу, але найголовніше ми отримаємо збій під час виконання.
        //У цей момент запустіть програму ще раз, і ви побачите, що вихідних даних немає взагалі. Це було очікувано. Ми можемо запустити чергу відправлення, додавши наступні рядки в viewDidAppear(_:)метод: if let queue = inactiveQueue { queue.activate() }
        //Метод activate()класу DispatchQueue запустить завдання. Зауважте, що оскільки чергу не було позначено як одночасну, вони виконуватимуться в послідовному порядку
        
        //let anotherQueue = DispatchQueue(label: "com.appcoda.anotherQueue", qos: .utility, attributes: .initiallyInactive)
        //Питання в тому, як ми можемо мати одночасну чергу, коли вона спочатку неактивна? Просто ми надаємо масив з обома значеннями замість того, щоб надавати одне значення як аргумент для attributesпараметра:
        let anotherQueue = DispatchQueue(label: "com.appcoda.anotherQueue", qos: .userInitiated, attributes: [.concurrent, .initiallyInactive]) //Ну знову в мене не перемішано як в туторіал, але кожен раз по різному.
        inactiveQueue = anotherQueue

        anotherQueue.async {
            for i in 0..<10 {
                print("🔴", i)
            }
        }
        anotherQueue.async {
            for i in 100..<110 {
                print("🔵", i)
            }
        }
        
        anotherQueue.async {
            for i in 1000..<1010 {
                print("⚫️", i)
            }
        }
        
       
    }
    
    //Затримка виконання
    func queueWithDelay() {
        let delayQueue = DispatchQueue(label: "com.appcoda.delayqueue", qos: .userInitiated)//створюємо новий DispatchQueue
         
        print(Date()) //друкуємо поточну дату для майбутньої перевірки часу очікування завдання
         
        let additionalTime: DispatchTimeInterval = .seconds(2)//вказуємо цей час очікування. Час затримки зазвичай є DispatchTimeIntervalзначенням enum (внутрішньо це інтерпретується як ціле число), яке додається до DispatchTimeзначення, щоб визначити затримку (це додавання йде далі). Ми використовуємо seconds метод, але крім нього також надано наступні: microseconds, milliseconds, nanoseconds
        //Тепер скористаємося чергою:
        //Метод now()повертає поточний час, і до цього значення ми додаємо додатковий час, який нам потрібен для затримки
        delayQueue.asyncAfter(deadline: .now() + additionalTime) {
            print(Date())
        }
        
        //Якщо ви не хочете використовувати жоден із попередньо визначених методів, згаданих вище, ви можете безпосередньо додати значення Doubleдо поточного часу:
//        delayQueue.asyncAfter(deadline: .now() + 0.75) {
//            print(Date())
//        }
    }
    
    //Доступ до головної та глобальної черг
    func fetchImage() {
        //Доступ до глобальної черги дуже простий:
        //let globalQueue = DispatchQueue.global()
        //Існує небагато властивостей, які можна змінити під час використання глобальних черг. Однак ви можете вказати клас якості обслуговування, який ви хочете використовувати:
        //let globalQueue = DispatchQueue.global(qos: .userInitiated)
        //Ви можете використовувати його як будь-яку іншу чергу, яку ми бачили досі:
//        globalQueue.async {
//            for i in 0..<10 {
//                print("🔴", i)
//            }
//        }
        //Використовуючи чи ні глобальні черги, майже виключено той факт, що вам доведеться досить часто звертатися до основної черги; швидше за все для оновлення інтерфейсу користувача. Доступ до основної черги з будь-якої іншої черги простий, як показано в наступному фрагменті, і під час виклику ви вказуєте, синхронне чи асинхронне це виконання:
//        DispatchQueue.main.async {
//            // Do something
//        }
        //Фактично, ви побачите всі доступні параметри для основної черги, просто ввівши частину DispatchQueue.main.; Xcode автоматично запропонує вам усі методи, які можна викликати в основній черзі, але перераховане вище – це те, що вам потрібно найчастіше (справді, це те, що зазвичай застосовується, і Xcode автоматично пропонує доступні методи для будь-якої черги після введення назви черги та натискання символу крапки «.»). Ви також можете додати затримку до виконання блоку відповідно до того, що ми бачили в попередній частині.
        
        //приклад того, як ми можемо використовувати основну чергу для оновлення нашого інтерфейсу користувача. У початковому проекті, над яким ви працюєте, ViewControllerсцена у Main.storyboardфайлі містить подання зображення, а відповідну властивість IBOutlet підключено до ViewControllerкласу. Тут ми перейдемо до fetchImage()(все ще порожнього) методу та отримаємо необхідний код для завантаження логотипу Appcoda та відображення його на зображенні
        //Зверніть увагу, що насправді ми не оновлюємо інтерфейс користувача в основній черзі, натомість ми намагаємося зробити це у фоновому потоці, до якого dataTask(...)запускається блок обробки завершення методу.
        let imageURL: URL = URL(string: "https://www.appcoda.com/wp-content/uploads/2015/12/blog-logo-dark-400.png")! //була помилка через використання http - він вважається не захищеним - треба використорувати лише з посилання SSL сертифікатом https
         
            (URLSession(configuration: URLSessionConfiguration.default)).dataTask(with: imageURL, completionHandler: { (imageData, response, error) in
         
                if let data = imageData {
                    print("Did download image data")
                    //self.imageView.image = UIImage(data: data)
                    //Незважаючи на те, що ми отримуємо інформацію про те, що зображення завантажено, ми не можемо побачити його в режимі перегляду зображення, оскільки інтерфейс користувача не оновлено. Швидше за все, зображення буде показано через кілька секунд після початкового повідомлення (щось не гарантоване, що станеться, якщо в програмі також виконуються інші завдання), але проблеми на цьому не закінчуються; ви також отримаєте дуже довгий журнал помилок зі скаргами на оновлення інтерфейсу користувача, зроблені у фоновому потоці.
                    //Тепер давайте змінимо цю проблемну поведінку та скористаємося основною чергою, щоб змінити наш інтерфейс користувача.
                    DispatchQueue.main.async {
                            self.imageView.image = UIImage(data: data)
                        }
                }
            }).resume()
        
    }
    
    //Використання об’єктів DispatchWorkItem - залишилася не дуже розкритою для мене..
    //DispatchWorkItem — це блок коду, який можна відправити в будь-яку чергу, і, отже, код, що міститься, має виконуватися у фоновому режимі або в основному потоці .
    //Найпростіший спосіб використання такого робочого елемента проілюстровано нижче:

//    let workItem = DispatchWorkItem {
//        // Do something
//    }
    //Давайте розглянемо невеликий приклад, щоб зрозуміти, як DispatchWorkItemвикористовуються об’єкти.
    func useWorkItem() {
        var value = 10
         
        let workItem = DispatchWorkItem {
            value += 5
        }
        //Метою нашого робочого елемента є збільшення значення змінної value на 5. Ми використовуємо workItem об’єкт, викликаючи perform()метод, як показано:
        workItem.perform() //цей медод додасть вже до значення + 5
        //Цей рядок відправлятиме робочий елемент у головний потік, але ви завжди можете використовувати й інші черги. Розглянемо такий приклад:
        let queue = DispatchQueue.global()
//        queue.async {
//            workItem.perform()
//        }
        //Це також чудово спрацює. Однак існує швидший спосіб відправити такий робочий елемент; Клас DispatchQueue надає зручний метод для цієї мети:
        queue.async(execute: workItem) //цей також додає + 5
        //Коли робочий елемент відправляється, ви можете повідомити про це свою основну чергу (або будь-яку іншу чергу, якщо хочете), як показано далі:
        //виведе значення змінної valueна консолі, і воно викликається, коли робочий елемент відправляється
        workItem.notify(queue: DispatchQueue.main) {
            print("value = ", value) //чому 20 - якщо ми до 10 додаємо 5.. тому що в нас више працює 2 різних способи як запустити роботу методу
        }
    }
}
